{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "batch_input_shape": [null, 49, 224, 3], "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000d\u0001\u001b\u0000d\u0002\u0018\u0000S\u0000)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>s\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "trainable": true, "nb_filter": 3, "nb_row": 1, "nb_col": 1, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.1}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "trainable": true, "nb_filter": 32, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "trainable": true, "nb_filter": 64, "nb_row": 5, "nb_col": 5, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "trainable": true, "nb_filter": 64, "nb_row": 3, "nb_col": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "trainable": true, "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.3}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "output_dim": 512, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 2688}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "output_dim": 10, "init": "glorot_uniform", "activation": "tanh", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 512}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 10}}], "keras_version": "1.2.2"}